# Toposolid Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Toposolid Class
Members See Also
---
An object that represents a Toposolid within the Autodesk Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class Toposolid : CeilingAndFloor
```

Visual Basic
---
```text
Public Class Toposolid _
	Inherits CeilingAndFloor
```

Visual C++
---
```text
public ref class Toposolid : public CeilingAndFloor
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..CeilingAndFloor Autodesk.Revit.DB..::..Toposolid
# See Also
Toposolid Members
Autodesk.Revit.DB Namespace